In [1]:
import numpy as np
import pandas as pd

## 5.2.2 按轴删除记录

In [16]:
ser = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
ser2 = ser.drop('c') # 返回一个新的object，并不删去原始数据的内容
ser2

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [17]:
del ser2['b']
ser2

a    0.0
d    3.0
e    4.0
dtype: float64

In [18]:
ser # 原始数组不变

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [19]:
# 删除不存在的索引会报错
try:
    ser2.drop('c')
except ValueError as e:
    print("错误信息:", e)

错误信息: labels ['c'] not contained in axis

### 删除多个索引

In [20]:
ser3 = ser.drop(['d', 'c'])
ser3

a    0.0
b    1.0
e    4.0
dtype: float64

## DataFrame，index能按行或列的axis来删除：

In [21]:
df = pd.DataFrame(np.arange(16).reshape(4, 4),
                    index=['北京', '上海', '广州', '深圳'],
                    columns=['one', 'two', 'three', 'four'])
df

    one  two  three  four
北京    0    1      2     3
上海    4    5      6     7
广州    8    9     10    11
深圳   12   13     14    15

### 删除行

In [22]:
df2 = df.drop(['北京', '上海']) # 默认是axis 0 删除行
df2

    one  two  three  four
广州    8    9     10    11
深圳   12   13     14    15

### 删除列

In [23]:
df3 = df.drop('two', axis=1) # axis=1或axis='columns'
df3

    one  three  four
北京    0      2     3
上海    4      6     7
广州    8     10    11
深圳   12     14    15

In [24]:
df4 = df.drop(['two', 'four'], axis='columns')
df4

    one  three
北京    0      2
上海    4      6
广州    8     10
深圳   12     14

drop也可以不返回一个新的object，而是直接更改原始数据

In [25]:
# inplace=True 直接删除源数据
df.drop('广州', inplace=True)
df

    one  two  three  four
北京    0    1      2     3
上海    4    5      6     7
深圳   12   13     14    15

In [26]:
del ser, ser2, ser3, df, df2, df3, df4